<template>
  <div>
    <n-h1 id="功能测试首页">
      <Icon size="30" color="#18A058">
        <ClipboardTextLtr20Filled/>
      </Icon>
      功能测试模块
    </n-h1>
    <n-hr></n-hr>
    <n-h2 id="介绍">
      <Icon size="20" color="#18A058">
        <DocumentText/>
      </Icon>
      介绍
    </n-h2>
    <SvgIcons name="test1" style="float: right;width: 40rem;height: 40rem"></SvgIcons>
    <n-text>
      功能测试是测试被测软件或应用程序的“功能”。
      它测试了被测软件的行为。根据客户的需求，称为软件规范或需求规范的文档将用作测试应用程序的指南。
      根据数据雕刻测试数据，并准备一组测试用例。然后在真实环境中对软件进行测试，以检查实际结果是否与预期结果同步。该技术被称为黑盒技术，通常是手动执行的，在发现错误方面也非常有效。
    </n-text>
    <n-hr></n-hr>
    <n-h2 id="分类">
      <Icon size="20" color="#18A058">
        <DocumentText/>
      </Icon>
      分类
    </n-h2>
    <n-h3>冒烟测试：</n-h3>
    <n-text>
      在实际系统测试之前执行此类测试，以检查关键功能是否正常运行，以便进行进一步的广泛测试。
      反过来，这节省了重新安装新版本的时间，并且在关键功能无法正常工作时避免了进一步的测试。这是测试应用程序的通用方法。
    </n-text>
    <n-h3>健全性测试：</n-h3>
    <n-text>
      这是一种测试，其中仅测试特定功能或已修复的错误，以检查功能是否正常运行，并查看是否由于相关组件的更改而没有其他问题。这是测试应用程序的特定方法。
    </n-text>
    <n-h3>集成测试：</n-h3>
    <n-text>
      当软件的两个或多个功能或组件集成在一起形成一个系统时，将执行集成测试。当组件合并成一个整体时，它基本上检查软件的正常功能。
    </n-text>
    <n-h3>回归测试：</n-h3>
    <n-text>
      在修复了在第一轮测试中发现的错误之后，在收到软件的构建版本之后执行回归测试。它会验证错误是否已修复，并检查整个软件在所做的更改中是否工作正常。
    </n-text>
    <n-h3>本地化测试：</n-h3>
    <n-text>
      这是一个测试过程，用于检查软件使用客户端要求的其他语言转换为应用程序时的功能。
      本地化是指使产品，应用程序或文档内容适应特定区域或地区的文化，语言和其他要求。
      本地化缩写为l10n，其中10是l和n之间的字母数。当想到本地化时，想到的是应用程序的用户界面和文档采用特定的语言或语言环境。但是本地化不仅限于此。
      在本地化应用程序时，将自定义以下重要领域：
      日期和时间格式（包括数字格式）
      使用的货币
      键盘用法
      排序，对齐和整理数据
      配色方案，符号和图标
      在给定文化中，文本和图形可能被视为敏感或可能被误解。
      多种法律要求
      本地化的主要目的是使产品的外观和感觉对目标受众而言，看起来像是专门为满足他们的需求而创建的。
    </n-text>
    <n-h3>用户验收测试:</n-h3>
    <n-text>
      在用户验收测试中，会考虑用户的易用性，根据用户的舒适度和接受程度对应用程序进行测试。
      实际的最终用户或客户端将获得一个试用版，以在其办公室设置中使用，以检查该软件是否在实际环境中按照其要求运行。该测试在最终启动之前进行，也称为Beta测试或最终用户测试。
    </n-text>
    <n-hr></n-hr>
    <n-h2 id="用例">
      <Icon size="20" color="#18A058">
        <DocumentText/>
      </Icon>
      测试用例的编写
    </n-h2>
    <n-h3>定义：</n-h3>
    <SvgIcons name="testcase" style="float: right;width: 40rem;height: 40rem"></SvgIcons>
    <n-text>
      （1）测试用例（Test Case）是为特定的目的而设计的一组测试输入、执行条件和预期的结果。（2）通过大量的测试用例来检验软件的运行效果，它是指导测试工作进行的依据。
    </n-text>
    <n-h3>编写测试用例的根本目的：</n-h3>
    <n-text>
      是有效地找出软件可能存在的缺欠，为了达到这个目的，需要分析被测试软件的特征，运用有效地测试用例设计方法，尽量使用较少的测试用例，同时满足合理的测试需求覆盖，从而达到"少花时间多办事"的效果。
    </n-text>
    <n-h3>测试用例的特征∶</n-h3>
    <n-text>
      （1）最有可能抓住错误的;（2）不是重复的、多余的;（3）一组相似测试用例中最有效的;（4）既不是太简单，也不是太复杂。
    </n-text>
    <n-h3>设计测试用例的基本准则：</n-h3>
    <n-text>
      （1）测试用例的代表性：能够代表并覆盖各种合理的和不合理的、合法的和非法的、边界的和越界的以及极限的输入数据、操作和环境设置等。（2）测试结果的可判定性：即测试结果的正确性是可判定的，每一个测试用例都应有相应的期望结果。（3）测试结果的可再现性：即对同样的测试用例，系统的执行结果应当是相同的。
    </n-text>
    <n-h3>测试用例的意义：</n-h3>
    <n-text>
      （1）可以避免盲目测试，并提高测试效率。（2）突出重点，目的明确。（3）版本更新时，只需要修正少数测试用例，降低工作强度，缩短项目周期.（4）复用度提升，易于开展测试。
    </n-text>
    <n-h3>测试用例质量：</n-h3>
    <n-text>
      （1）有效性主要指的是测试用例是否可以发现软件的缺陷、至少可能发现软件的缺陷。（2）可仿效性主要指测试用例可以测试多项内容，因而可以减少测试事例的数量。（3）经济性主要指测试用例在测试执行、分析和调试方面是否经济。（4）修改性主要指测试用例在日后的维护方面是否易于修改。
    </n-text>
    <n-h3>测试用例设计方法:</n-h3>
    <n-text>
      等价类划分法、
      边界值分析法、
      决策表法、
      因果图法、
      场景法、
      正交试验法、
      错误推测法
    </n-text>
    <n-h3>测试主要流程：</n-h3>
    <n-text>
      测试计划–需求分析–测试用例设计–冒烟测试–测试执行–测试报告–验收测试
    </n-text>
    <n-hr></n-hr>
    <n-h2 id="用例要素">
      <Icon size="20" color="#18A058">
        <DocumentText/>
      </Icon>
      用例编写8大要素：
    </n-h2>
    <SvgIcons name="testcase2" style="float: right;width: 40rem;height: 40rem"></SvgIcons>
    <n-h3>测试用例编号：</n-h3>
    <n-text>
      字符和数字组成的字符串，由产品编号－测试阶段－测试项－测试子项－测试编号
    </n-text>
    <n-h3>测试项：</n-h3>
    <n-text>
      当前测试用例所在测试大类、被测试需求、被测模块、被测单元等。
    </n-text>
    <n-h3>测试用例标题：</n-h3>
    <n-text>
      用概括性的语言描述测试用例的关注点和出发点，用例标题名不能重复。
    </n-text>
    <n-h3>预置条件：</n-h3>
    <n-text>
      执行当前测试用例所需要满足的条件
    </n-text>
    <n-h3>测试数据：</n-h3>
    <n-text>
      用例执行过程中需要加工的外部信息,根据软件测试用例的具体情况，有手工输入、文件、数据库记录等.
    </n-text>
    <n-h3>操作步骤：</n-h3>
    <n-text>
      执行测试用例需要经过的操作步骤，需要明确描述出每一个步骤。
    </n-text>
    <n-h3>预期结果：</n-h3>
    <n-text>
      试用例的预期输出结果。
    </n-text>
    <n-h3>重要级别：</n-h3>
    <n-text>
      高＼中＼低三种。划分原则：根据被测功能的使用范围和频率划分；根据被测功能的重要性划分；根据需求重要程度划分。中级以上测试用例必须执行。
    </n-text>
    <n-hr></n-hr>
    <n-h2 id="bug要素">
      <Icon size="20" color="#18A058">
        <DocumentText/>
      </Icon>
      BUG要素：
    </n-h2>
    <n-h3>缺陷id：</n-h3>
    <n-text>
      一般由缺陷管理系统自动生成
    </n-text>
    <n-h3>缺陷标题：</n-h3>
    <n-text>
      概要描述缺陷
    </n-text>
    <SvgIcons name="bug" style="float: right;width: 40rem;height: 40rem"></SvgIcons>
    <n-h3>发现人：</n-h3>
    <n-text>
      一般是缺陷管理系统自动获取当前用户
    </n-text>
    <n-h3>发现时间：</n-h3>
    <n-text>
      一般是缺陷系统自动获取当前系统时间
    </n-text>
    <n-h3>版本：</n-h3>
    <n-text>
      软件版本
    </n-text>
    <n-h3>缺陷所属模块：</n-h3>
    <n-text>
      软件的bug属于哪个功能模块
    </n-text>
    <n-h3>是否可重现：</n-h3>
    <n-text>
      这个可以不写
    </n-text>
    <n-h3>严重度：</n-h3>
    <n-text>
      缺陷的严重程度
    </n-text>
    <n-h3>优先级：</n-h3>
    <n-text>
      缺陷修复的优先级
    </n-text>
    <n-h3>缺陷状态：</n-h3>
    <n-text>
      比如禅道中提交后为激活状态
    </n-text>
    <n-h3>指派给：</n-h3>
    <n-text>
      选择修改缺陷的开发人员
    </n-text>
    <n-h3>Bug复现步骤：</n-h3>
    <n-text>
      描述Bug出现的详细过程，即：
      　　1.URL、用户名、密码；
      　　2.操作步骤；
      　　3.预期结果；
      　　4.实际结果；
      　　5. Bug截图
    </n-text>
  </div>
</template>

<script setup>
import {NH1, NH2, NHr, NText, NH3} from 'naive-ui'
import {Icon} from '@vicons/utils'
import {ClipboardTextLtr20Filled} from '@vicons/fluent'
import SvgIcons from "../SvgIcons.vue";
import {DocumentText} from '@vicons/ionicons5'
</script>

<style scoped>

</style>